In [3]:
import numpy as np
import pandas as pd

In [ ]:
df = pd.DataFrame({'Name': pd.Series(['Abin','Bob','Evans']),
                   'Age': pd.Series([21,23,43])
                   }
                  )

In [6]:
df = pd.DataFrame({})
df

Empty DataFrame
Columns: []
Index: []

In [ ]:
df

    Name  Age
0   Abin   21
1    Bob   23
2  Evans   43

In [ ]:
#Adding new columns
df['Height'] = pd.Series([5.1,5.8,6.7])

In [ ]:
df

    Name  Age  Height
0   Abin   21     5.1
1    Bob   23     5.8
2  Evans   43     6.7

In [ ]:
df = pd.read_csv("/content/Salaries.csv")

In [ ]:
df

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

# ANALYSIS

In [ ]:
#Top rows
df.head()  #Get top 5 rows - Default returns 5 rows

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [ ]:
df.head(2)

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000

In [ ]:
# Bottom rows
df.tail()

         rank discipline  phd  service     sex  salary
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [ ]:
df.tail(3)

    rank discipline  phd  service     sex  salary
75  Prof          B   17       17  Female  124312
76  Prof          A   28       14  Female  109954
77  Prof          A   23       15  Female  109646

In [ ]:
#Total no of rows and columns
df.shape

(78, 6)

In [ ]:
#Total no of elements or data points
df.size

468

In [ ]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [ ]:
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [ ]:
df.ndim

2

In [ ]:
#rows index and column names
df.axes

[RangeIndex(start=0, stop=78, step=1),
 Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')]

In [ ]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
df1 = df.values
print(df1)

[['Prof' 'B' 56 49 'Male' 186960]
 ['Prof' 'A' 12 6 'Male' 93000]
 ['Prof' 'A' 23 20 'Male' 110515]
 ['Prof' 'A' 40 31 'Male' 131205]
 ['Prof' 'B' 20 18 'Male' 104800]
 ['Prof' 'A' 20 20 'Male' 122400]
 ['AssocProf' 'A' 20 17 'Male' 81285]
 ['Prof' 'A' 18 18 'Male' 126300]
 ['Prof' 'A' 29 19 'Male' 94350]
 ['Prof' 'A' 51 51 'Male' 57800]
 ['Prof' 'B' 39 33 'Male' 128250]
 ['Prof' 'B' 23 23 'Male' 134778]
 ['AsstProf' 'B' 1 0 'Male' 88000]
 ['Prof' 'B' 35 33 'Male' 162200]
 ['Prof' 'B' 25 19 'Male' 153750]
 ['Prof' 'B' 17 3 'Male' 150480]
 ['AsstProf' 'B' 8 3 'Male' 75044]
 ['AsstProf' 'B' 4 0 'Male' 92000]
 ['Prof' 'A' 19 7 'Male' 107300]
 ['Prof' 'A' 29 27 'Male' 150500]
 ['AsstProf' 'B' 4 4 'Male' 92000]
 ['Prof' 'A' 33 30 'Male' 103106]
 ['AsstProf' 'A' 4 2 'Male' 73000]
 ['AsstProf' 'A' 2 0 'Male' 85000]
 ['Prof' 'A' 30 23 'Male' 91100]
 ['Prof' 'B' 35 31 'Male' 99418]
 ['Prof' 'A' 38 19 'Male' 148750]
 ['Prof' 'A' 45 43 'Male' 155865]
 ['AsstProf' 'B' 7 2 'Male' 91300]
 ['Prof' 'B' 21 20 'Male' 123683]
 ['AssocProf' 'B' 9 7 'Male' 107008]
 ['Prof' 'B' 22 21 'Male' 155750]
 ['Prof' 'A' 27 19 'Male' 103275]
 ['Prof' 'B' 18 18 'Male' 120000]
 ['AssocProf' 'B' 12 8 'Male' 119800]
 ['Prof' 'B' 28 23 'Male' 126933]
 ['Prof' 'B' 45 45 'Male' 146856]
 ['Prof' 'A' 20 8 'Male' 102000]
 ['AsstProf' 'B' 4 3 'Male' 91000]
 ['Prof' 'B' 18 18 'Female' 129000]
 ['Prof' 'A' 39 36 'Female' 137000]
 ['AssocProf' 'A' 13 8 'Female' 74830]
 ['AsstProf' 'B' 4 2 'Female' 80225]
 ['AsstProf' 'B' 5 0 'Female' 77000]
 ['Prof' 'B' 23 19 'Female' 151768]
 ['Prof' 'B' 25 25 'Female' 140096]
 ['AsstProf' 'B' 11 3 'Female' 74692]
 ['AssocProf' 'B' 11 11 'Female' 103613]
 ['Prof' 'B' 17 17 'Female' 111512]
 ['Prof' 'B' 17 18 'Female' 122960]
 ['AsstProf' 'B' 10 5 'Female' 97032]
 ['Prof' 'B' 20 14 'Female' 127512]
 ['Prof' 'A' 12 0 'Female' 105000]
 ['AsstProf' 'A' 5 3 'Female' 73500]
 ['AssocProf' 'A' 25 22 'Female' 62884]
 ['AsstProf' 'A' 2 0 'Female' 72500]
 ['AssocProf' 'A' 10 8 'Female' 77500]
 ['AsstProf' 'A' 3 1 'Female' 72500]
 ['Prof' 'B' 36 26 'Female' 144651]
 ['AssocProf' 'B' 12 10 'Female' 103994]
 ['AsstProf' 'B' 3 3 'Female' 92000]
 ['AssocProf' 'B' 13 10 'Female' 103750]
 ['AssocProf' 'B' 14 7 'Female' 109650]
 ['Prof' 'A' 29 27 'Female' 91000]
 ['AssocProf' 'A' 26 24 'Female' 73300]
 ['Prof' 'A' 36 19 'Female' 117555]
 ['AsstProf' 'A' 7 6 'Female' 63100]
 ['Prof' 'A' 17 11 'Female' 90450]
 ['AsstProf' 'A' 4 2 'Female' 77500]
 ['Prof' 'A' 28 7 'Female' 116450]
 ['AsstProf' 'A' 8 3 'Female' 78500]
 ['AssocProf' 'B' 12 9 'Female' 71065]
 ['Prof' 'B' 24 15 'Female' 161101]
 ['Prof' 'B' 18 10 'Female' 105450]
 ['AssocProf' 'B' 19 6 'Female' 104542]
 ['Prof' 'B' 17 17 'Female' 124312]
 ['Prof' 'A' 28 14 'Female' 109954]
 ['Prof' 'A' 23 15 'Female' 109646]]

In [ ]:
type(df1)

numpy.ndarray

# Statistics

In [ ]:
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [ ]:
df['service'].describe()

count    78.000000
mean     15.051282
std      12.139768
min       0.000000
25%       5.250000
50%      14.500000
75%      20.750000
max      51.000000
Name: service, dtype: float64

# DATA SLICING

In [ ]:
df['rank']

0          Prof
1          Prof
2          Prof
3          Prof
4          Prof
        ...
73         Prof
74    AssocProf
75         Prof
76         Prof
77         Prof
Name: rank, Length: 78, dtype: object

In [ ]:
df_rank = df.groupby(by='rank')
df_rank

In [ ]:
df_rank.count()

           discipline  phd  service  sex  salary
rank
AssocProf          13   13       13   13      13
AsstProf           19   19       19   19      19
Prof               46   46       46   46      46

In [ ]:
df_rank.mean()

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

# MEAN salary for male and female

In [ ]:
df_sex =df.groupby(by = 'sex')

In [ ]:
df_sex.mean()

              phd    service         salary
sex
Female  16.512821  11.564103  101002.410256
Male    22.897436  18.538462  115045.153846

In [ ]:
#Filtering the columns
df_sex[['salary']].mean()

               salary
sex
Female  101002.410256
Male    115045.153846

In [ ]:
df.groupby(by = 'rank', sort = False)[['salary']].mean()

                  salary
rank
Prof       123624.804348
AssocProf   91786.230769
AsstProf    81362.789474

# FILTERING

In [ ]:
# >,<,<=,>=, != like conditions

df['salary']>160000 #condition

df_sub = df[df['salary']>160000]

In [ ]:
df_sub

    rank discipline  phd  service     sex  salary
0   Prof          B   56       49    Male  186960
13  Prof          B   35       33    Male  162200
72  Prof          B   24       15  Female  161101

# Find the mean value of salary for discipline A

In [ ]:
df[df['discipline']=='A']['salary'].mean()

98331.11111111111

Extract (filter) only observations with high sal (>100k)

and find how many female and male professors in each group

In [ ]:
data = df[df['salary']>100000].groupby(by = 'sex')

In [ ]:
data[['salary']].count()
# df[df['salary']>100000].groupby(by = 'sex')[['salary']].count()

        salary
sex
Female      21
Male        25

# SLICING

In [ ]:
df[['rank','salary']]

         rank  salary
0        Prof  186960
1        Prof   93000
2        Prof  110515
3        Prof  131205
4        Prof  104800
..        ...     ...
73       Prof  105450
74  AssocProf  104542
75       Prof  124312
76       Prof  109954
77       Prof  109646

[78 rows x 2 columns]

In [ ]:
df[10:20]

        rank discipline  phd  service   sex  salary
10      Prof          B   39       33  Male  128250
11      Prof          B   23       23  Male  134778
12  AsstProf          B    1        0  Male   88000
13      Prof          B   35       33  Male  162200
14      Prof          B   25       19  Male  153750
15      Prof          B   17        3  Male  150480
16  AsstProf          B    8        3  Male   75044
17  AsstProf          B    4        0  Male   92000
18      Prof          A   19        7  Male  107300
19      Prof          A   29       27  Male  150500

In [ ]:
# return certain rows and certain columns
df.iloc[10:20,[0,3,4,5]]

        rank  service   sex  salary
10      Prof       33  Male  128250
11      Prof       23  Male  134778
12  AsstProf        0  Male   88000
13      Prof       33  Male  162200
14      Prof       19  Male  153750
15      Prof        3  Male  150480
16  AsstProf        3  Male   75044
17  AsstProf        0  Male   92000
18      Prof        7  Male  107300
19      Prof       27  Male  150500

In [ ]:
df.iloc[0]

rank            Prof
discipline         B
phd               56
service           49
sex             Male
salary        186960
Name: 0, dtype: object

In [ ]:
# All rows and 1 and 2nd columns
df.iloc[:,1:3]

   discipline  phd
0           B   56
1           A   12
2           A   23
3           A   40
4           B   20
..        ...  ...
73          B   18
74          B   19
75          B   17
76          A   28
77          A   23

[78 rows x 2 columns]

In [ ]:
df.iloc[1:3,0:2]

   rank discipline
1  Prof          A
2  Prof          A

In [ ]:
#LOC
# iloc - used based on index for the columns (columns var unknown)
# loc - based on the name of the columns (when columns var are known)


df.loc[10:20,['rank','salary']]

        rank  salary
10      Prof  128250
11      Prof  134778
12  AsstProf   88000
13      Prof  162200
14      Prof  153750
15      Prof  150480
16  AsstProf   75044
17  AsstProf   92000
18      Prof  107300
19      Prof  150500
20  AsstProf   92000

# SORTING

In [ ]:
df_sorted = df.sort_values(by = 'service')
df_sorted.head()

        rank discipline  phd  service     sex  salary
55  AsstProf          A    2        0  Female   72500
23  AsstProf          A    2        0    Male   85000
43  AsstProf          B    5        0  Female   77000
17  AsstProf          B    4        0    Male   92000
12  AsstProf          B    1        0    Male   88000

In [ ]:
df.sort_index(ascending=True)

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [ ]:
df.sort_values(by = ['service','salary'], ascending=[True, False])

        rank discipline  phd  service     sex  salary
52      Prof          A   12        0  Female  105000
17  AsstProf          B    4        0    Male   92000
12  AsstProf          B    1        0    Male   88000
23  AsstProf          A    2        0    Male   85000
43  AsstProf          B    5        0  Female   77000
..       ...        ...  ...      ...     ...     ...
40      Prof          A   39       36  Female  137000
27      Prof          A   45       43    Male  155865
36      Prof          B   45       45    Male  146856
0       Prof          B   56       49    Male  186960
9       Prof          A   51       51    Male   57800

[78 rows x 6 columns]

# Aggregation Functions

In [ ]:
# some of them for descriptive statistics
# max, min, count, agg

df.max()
df.min()

rank          AssocProf
discipline            A
phd                   1
service               0
sex              Female
salary            57800
dtype: object

In [ ]:
df[['service','salary']].agg(['min','mean', 'max'])

        service         salary
min    0.000000   57800.000000
mean  15.051282  108023.782051
max   51.000000  186960.000000

In [ ]:
df.agg({'salary':['min','max','mean'], 'service': ['nunique']})

                salary  service
max      186960.000000      NaN
mean     108023.782051      NaN
min       57800.000000      NaN
nunique            NaN     33.0